In [1]:
import pandas as pd

In [3]:
var = pd.DataFrame({"a":[1,2,3,4,5],"b":[6,7,8,9,10]})

In [5]:
var

   a   b
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [6]:
# now we will insert data syntax is .insert(indexno,coloumn name,data)

In [9]:
var.insert(2,'python',var["a"]) # index no that is coloumn no

In [10]:
var

   a   b  python
0  1   6       1
1  2   7       2
2  3   8       3
3  4   9       4
4  5  10       5

In [11]:
# now to copy limited data

In [18]:
var['pyhon_1'] = var["a"][:2] # copying values upto 2nd coloumn 2 excluded

In [19]:
var

   a   b  python  pyhon_1
0  1   6       1      1.0
1  2   7       2      2.0
2  3   8       3      NaN
3  4   9       4      NaN
4  5  10       5      NaN

In [20]:
check = pd.Series([1,2,3,4,5,6])

In [21]:
check

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [22]:
check.insert(1,'check',[10,12,13,14,15,16])

AttributeError: 'Series' object has no attribute 'insert'

In [23]:
# now we will delete data

In [24]:
var3 = var.pop("b")

In [25]:
var3

0     6
1     7
2     8
3     9
4    10
Name: b, dtype: int64

In [26]:
var

   a  python  pyhon_1
0  1       1      1.0
1  2       2      2.0
2  3       3      NaN
3  4       4      NaN
4  5       5      NaN